<template>
  <div class="w-full">
    <AppHero />
    <AppAbout />
    
    <div class="space-y-4 md:space-y-6 lg:space-y-8 mb-16">
      <AppExperts />
      <AppFee />
    </div>
    
    <!-- <AppSop /> -->
    <!-- <AppDownload /> -->
    <ImageSlider :slides="heroSlides" :auto-play-interval="6000" />
  </div>
</template>

<script setup lang="ts">
import { ref } from 'vue';
import AppHero from '@/components/AppHero.vue';
import AppAbout from '@/components/AppAbout.vue';
// import AppSop from '@/components/AppSop.vue';
import AppFee from '@/components/AppFee.vue';
import AppExperts from '@/components/AppExperts.vue';
// import AppDownload from '@/components/AppDownload.vue';

import ImageSlider from '@/components/ImageSlider.vue';



const slideContents = {
  '001.jpg': {
    title: '',
    subtitle: 'ดร.ชลิยา วามะลุน รองผู้อำนวยการด้านการพยาบาล โรงพยาบาลมะเร็งอุบลราชธานี กรมการแพทย์ ร่วมเป็นวิทยากรบรรยายในการประชุมโครงการพัฒนาศักยภาพด้านจริยธรรมการวิจัยในมนุษย์ ประจำปีงบประมาณ พ.ศ. 2569 ภายใต้กิจกรรมประชุมเชิงปฏิบัติการจัดทำมาตรฐานการปฏิบัติงาน (Standard Operating Procedures : SOPs) ด้านจริยธรรมการวิจัยในมนุษย์ ระหว่างวันที่ 25 – 27 พฤษภาคม 2569 ณ โรงพยาบาลโรคผิวหนังเขตร้อนภาคใต้ จังหวัดตรัง ',
    link: 'https://www.facebook.com/share/p/1B9nRYeGuh/' 
  },
  'a1.jpg': {
    title: 'การประชุมคณะกรรมการฯ <span class="text-gold">"ครั้งที่ 2/2569 "</span>',
    subtitle: 'ดร.ชลิยา วามะลุน ประธานคณะกรรมการจริยธรรมการวิจัยในมนุษย์ โรงพยาบาลมะเร็งอุบลราชธานี พร้อมด้วยแพทย์หญิงชุติวรรณ วิวัฒนาสิทธิพงศ์ รองผู้อำนวยการด้านการแพทย์ พร้อมด้วยคณะกรรมการจริยธรรมการวิจัยในมนุษย์โรงพยาบาลมะเร็งอุบลราชธานี เข้าร่วมการติดตามหลังการตรวจรับรองคุณภาพมาตรฐานคณะกรรมการจริยธรรมการวิจัยในมนุษย์ จาก พ.อ.ศ.นพ. ชาญชัย ไตรวารี ผู้ประสานงานการตรวจรับรอง โดยมีคณะผู้ตรวจรับรองคุณภาพมาตรฐานคณะกรรมการจริยธรรมการวิจัยในมนุษย์ National Ethics Committee Accreditation System of Thailand : NECAST โดย พ.ท.หญิง ดร. นิลภา สุขเจริญ ในการติดตามหลังการตรวจรับรองคุณภาพมาตรฐานคณะกรรมการจริยธรรมการวิจัยในมนุษย์โรงพยาบาลมะเร็งอุบลราชธานี ในวันที่ 23 ธันวาคม 2568 เวลา 13.00-17.00 น. ณ ห้องประชุม 7/1 ชั้น 7 โรงพยาบาลมะเร็งอุบลราชธานี',
    link:'https://www.facebook.com/share/p/1Cf12LeejZ/'  
  },
  'a2.jpg': {
    title: 'เข้าร่วมการ <span class="text-gold">ติดตาม</span>หลังการตรวจรับรองคุณภาพมาตรฐานคณะกรรมการจริยธรรมการวิจัยในมนุษย์',
    subtitle: 'ดร.ชลิยา วามะลุน ประธานคณะกรรมการจริยธรรมการวิจัยในมนุษย์ โรงพยาบาลมะเร็งอุบลราชธานี พร้อมด้วยแพทย์หญิงชุติวรรณ วิวัฒนาสิทธิพงศ์ รองผู้อำนวยการด้านการแพทย์ พร้อมด้วยคณะกรรมการจริยธรรมการวิจัยในมนุษย์โรงพยาบาลมะเร็งอุบลราชธานี เข้าร่วมการติดตามหลังการตรวจรับรองคุณภาพมาตรฐานคณะกรรมการจริยธรรมการวิจัยในมนุษย์ จาก พ.อ.ศ.นพ. ชาญชัย ไตรวารี ผู้ประสานงานการตรวจรับรอง โดยมีคณะผู้ตรวจรับรองคุณภาพมาตรฐานคณะกรรมการจริยธรรมการวิจัยในมนุษย์ National Ethics Committee Accreditation System of Thailand : NECAST โดย พ.ท.หญิง ดร. นิลภา สุขเจริญ ในการติดตามหลังการตรวจรับรองคุณภาพมาตรฐานคณะกรรมการจริยธรรมการวิจัยในมนุษย์โรงพยาบาลมะเร็งอุบลราชธานี ในวันที่ 23 ธันวาคม 2568 เวลา 13.00-17.00 น. ณ ห้องประชุม 7/1 ชั้น 7 โรงพยาบาลมะเร็งอุบลราชธานี',
    link:'https://www.facebook.com/share/p/14hkvSQXKtj/'  
  },
  'a3.jpg': {
    title: 'SURVEY VISIT  <span class="text-gold"> CERTIFICATE </span>',
    subtitle: 'นายแพทย์เฉลิมพล ไชยรัตน์ ผู้อำนวยการโรงพยาบาลมะเร็งอุบลราชธานี พร้อมด้วยแพทย์หญิงชุติวรรณ วิวัฒนาสิทธิพงศ์ รองผู้อำนวยการด้านการแพทย์, ดร.ชลิยา วามะลุน รองผู้อำนวยการด้านการพยาบาล, นายอรรถวิทย์ ภักดี รองผู้อำนวยการด้านอำนวยการ พร้อมด้วยคณะกรรมการจริยธรรมการวิจัยในมนุษย์โรงพยาบาลมะเร็งอุบลราชธานี  หัวหน้ากลุ่มงาน, หัวหน้างาน และบุคลากรที่มีส่วนเกี่ยวข้องของโรงพยาบาลมะเร็งอุบลราชธานี ร่วมรับฟังการสรุปและรับใบประกาศ SURVEY VISIT CERTIFICATE จาก พ.อ.ศ.นพ. ชาญชัย ไตรวารี ผู้ประสานงานการตรวจรับรอง โดยมีคณะผู้ตรวจรับรองคุณภาพมาตรฐานคณะกรรมการจริยธรรมการวิจัยในมนุษย์ National Ethics Committee Accreditation System of Thailand : NECAST โดย   นพ.อ.รศ.นพ. นิธิพันธ์ สุขสุเมฆ พ.อ.ผศ.ดร.นพ.ศราวุธ จินดารัตน์ และ พ.ท.หญิง ดร. นิลภา สุขเจริญ  ในการตรวจรับรองคุณภาพมาตรฐานคณะกรรมการจริยธรรมการวิจัยในมนุษย์โรงพยาบาลมะเร็งอุบลราชธานี ในระหว่างวันที่ 21-23  เมษายน 2568 เวลา 08.00-18.00 น. ณ ห้องประชุมราชธานี ชั้น 8 โรงพยาบาลมะเร็งอุบลราชธานี',
    link:'https://www.facebook.com/share/p/17sbVZ1FA1/'
  },
   'b1.jpg': {
    title: 'ศึกษาดูงานเพื่อเตรียมความพร้อมการตรวจรับรองคุณภาพคณะกรรมการจริยธรรมการวิจัยในมนุษย์ ตามมาตรฐาน <span class="text-gold">NECAST</span>',
    subtitle:'การศึกษาดูงานเพื่อเตรียมความพร้อมการตรวจรับรองคุณภาพคณะกรรมการจริยธรรมการวิจัยในมนุษย์ ตามมาตรฐาน NECAST โดยสำนักงนการวิจัยแห่งชาติ (วช.) จากวิทยาลัยพยาบาลบรมราชชนนี สรรพสิทธิประสงค์ วันอังคารที่ 18 พฤศจิกายน 2568  ณ ห้องประชุมราขธานี ชั้น 8 อาคารอำนวยการผู้ป่วยนอกและรังสีวินิจฉัย โรงพยาบาลมะเร็งอุบลราชธานี',
    // link:'https://www.facebook.com/share/p/14hkvSQXKtj/'
  }
  ,
   'b2.jpg': {
    title: 'National Ethics Committee Accreditation System of Thailand :<span class="text-gold">NECAST</span>',
    subtitle: 'ต้อนรับคณะผู้ตรวจรับรองคุณภาพมาตรฐานคณะกรรมการจริยธรรมการวิจัยในมนุษย์ National Ethics Committee Accreditation System of Thailand : NECAST พ.อ.ศ.นพ. ชาญชัย ไตรวารี ผู้ประสานงานการตรวจรับรอง  พ.อ.รศ.นพ. นิธิพันธ์ สุขสุเมฆ พ.อ.ผศ.ดร.นพ.ศราวุธ จินดารัตน์ และ พ.ท.หญิง ดร. นิลภา สุขเจริญ  ในการตรวจรับรองคุณภาพมาตรฐานคณะกรรมการจริยธรรมการวิจัยในมนุษย์โรงพยาบาลมะเร็งอุบลราชธานี ในระหว่างวันที่ 21-23  เมษายน 2568 เวลา 08.00-18.00 น. ณ ห้องประชุมราชธานี ชั้น 8 โรงพยาบาลมะเร็งอุบลราชธานี'
  },
  
   'c1.jpg': {
    title: 'ประชุมเชิงปฏิบัติการและสังเกตการณ์ประเมินการรับรองการตรวจเยี่ยมและรับรองคุณภาพการปฏิบัติหน้าที่ของคณะกรรมการจริยธรรมการวิจัยในมนุษย์ จาก <span class="text-gold">NECAST</span>',
    subtitle:'ดร.ชลิยา วามะลุน รองผู้อำนวยการด้านการพยาบาล ประธานคณะกรรมการจริยธรรมการวิจัยในมนุษย์ โรงพยาบาลมะเร็งอุบลราชธานี กรมการแพทย์และ ดร.โสภิต ทับทิมหิน พยาบาลวิชาชีพชำนาญการพิเศษ เลขานุการคณะกรรมการฯ พร้อมด้วยบุคลากรโรงพยาบาลมะเร็งอุบลราชธานี เข้าร่วมประชุมเชิงปฏิบัติการและสังเกตการณ์ประเมินการรับรองการตรวจเยี่ยมและรับรองคุณภาพการปฏิบัติหน้าที่ของคณะกรรมการจริยธรรมการวิจัยในมนุษย์ จาก NECAST ในระหว่างวันที่ 25-28 กุมภาพันธ์ 2568 เวลา 09.00-17.00 น. ณ มหาวิทยาลัยเทคโนโลยีราชมงคลตะวันออก จ.ชลบุรี',
    link  :'https://www.facebook.com/share/p/18ydAMTcRq/'
  },

  // ,
  // 'a1.jpg': {
  //   title: 'คณะกรรมการจริยธรรมฯ <span class="text-gold">"พร้อมให้คำปรึกษา"</span>',
  //   subtitle: 'ดร.ชลิยา วามะลุน ประธานคณะกรรมการจริยธรรมการวิจัยในมนุษย์ โรงพยาบาลมะเร็งอุบลราชธานี พร้อมด้วยแพทย์หญิงชุติวรรณ วิวัฒนาสิทธิพงศ์ รองผู้อำนวยการด้านการแพทย์ พร้อมด้วยคณะกรรมการจริยธรรมการวิจัยในมนุษย์โรงพยาบาลมะเร็งอุบลราชธานี เข้าร่วมการติดตามหลังการตรวจรับรองคุณภาพมาตรฐานคณะกรรมการจริยธรรมการวิจัยในมนุษย์ จาก พ.อ.ศ.นพ. ชาญชัย ไตรวารี ผู้ประสานงานการตรวจรับรอง โดยมีคณะผู้ตรวจรับรองคุณภาพมาตรฐานคณะกรรมการจริยธรรมการวิจัยในมนุษย์ National Ethics Committee Accreditation System of Thailand : NECAST โดย พ.ท.หญิง ดร. นิลภา สุขเจริญ ในการติดตามหลังการตรวจรับรองคุณภาพมาตรฐานคณะกรรมการจริยธรรมการวิจัยในมนุษย์โรงพยาบาลมะเร็งอุบลราชธานี ในวันที่ 23 ธันวาคม 2568 เวลา 13.00-17.00 น. ณ ห้องประชุม 7/1 ชั้น 7 โรงพยาบาลมะเร็งอุบลราชธานี'
  // },
};

// 2. ดึงไฟล์รูปภาพด้วย Glob (โค้ดเดิมของคุณ)
const imageModules = import.meta.glob('/public/images/Gallarys/*.jpg', { eager: true });
const imagePaths = Object.keys(imageModules).map(path => path.replace('/public', ''));

// 3. นำข้อมูลมาประกอบร่างกัน
const heroSlides = ref(imagePaths.map(path => {
  // ดึงเฉพาะ "ชื่อไฟล์" ออกมาจาก Path (เช่น '/images/slider/a1.jpg' กลายเป็น 'a1.jpg')
  const filename = path.split('/').pop() ; 

  // ดึงข้อมูลข้อความจาก slideContents โดยหาจากชื่อไฟล์
  // ถ้าหารูปไหนไม่เจอ (ไม่ได้ตั้งข้อความไว้) ให้ใส่ค่าว่างไปแทนเพื่อไม่ให้โค้ดพัง
  const content = slideContents[filename ] || { title: '', subtitle: '' };

  return {
    image: path,
    title: content.title,
    subtitle: content.subtitle,
    link: content.link || '' // ถ้ามีลิงก์ก็ใส่ ถ้าไม่มีก็ใส่ค่าว่าง
    
  };
}));

</script>